Table of Contents
 Class LineSupportSegment
Namespace
IdeaRS.OpenModel.Model
Assembly
IdeaRS.OpenModel.dll
Line support on segment
[OpenModelClass("CI.StructModel.Structure.LineSupportSegment,CI.StructuralElements", "CI.StructModel.Structure.ILineSupportSegment,CI.BasicTypes")]
public class LineSupportSegment : OpenElementId
Inheritance
object
OpenObject
OpenElementId
LineSupportSegment
Inherited Members
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 FlexibleStiffnessRX
Support stiffness rotational RX
public double FlexibleStiffnessRX { get; set; }
Property Value
double
 FlexibleStiffnessRY
Support stiffness rotational RY
public double FlexibleStiffnessRY { get; set; }
Property Value
double
 FlexibleStiffnessRZ
Support stiffness rotational RZ
public double FlexibleStiffnessRZ { get; set; }
Property Value
double
 FlexibleStiffnessX
Support stiffness X dirrection
public double FlexibleStiffnessX { get; set; }
Property Value
double
 FlexibleStiffnessY
Support stiffness Y dirrection
public double FlexibleStiffnessY { get; set; }
Property Value
double
 FlexibleStiffnessZ
Support stiffness Z dirrection
public double FlexibleStiffnessZ { get; set; }
Property Value
double
 LocalCoordinateSystem
Support local coord system
public CoordSystem LocalCoordinateSystem { get; set; }
Property Value
CoordSystem
 Segment
Reference to geometrical segment3D
[OpenModelProperty("GeoSegment")]
public ReferenceElement Segment { get; set; }
Property Value
ReferenceElement
 SupportTypeRX
Support type in dirrection round X
public SupportTypeInDirrection SupportTypeRX { get; set; }
Property Value
SupportTypeInDirrection
 SupportTypeRY
Support type in dirrection round Y
public SupportTypeInDirrection SupportTypeRY { get; set; }
Property Value
SupportTypeInDirrection
 SupportTypeRZ
Support type in dirrection round Z
public SupportTypeInDirrection SupportTypeRZ { get; set; }
Property Value
SupportTypeInDirrection
 SupportTypeX
Support type in dirrection X
public SupportTypeInDirrection SupportTypeX { get; set; }
Property Value
SupportTypeInDirrection
 SupportTypeY
Support type in dirrection Y
public SupportTypeInDirrection SupportTypeY { get; set; }
Property Value
SupportTypeInDirrection
 SupportTypeZ
Support type in dirrection Z
public SupportTypeInDirrection SupportTypeZ { get; set; }
Property Value
SupportTypeInDirrection
 Edit this page